content-org/scripting.org
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_SECTION: scripting
#+HUGO_PAIRED_SHORTCODES: katex
#+OPTIONS: ^:{}
#+PROPERTY: header-args:jupyter-julia :session jl :exports both :eval no-export :async yes

* Scripts
:PROPERTIES:
:EXPORT_FILE_NAME: scripts
:END:

** Script Structure

A Julia script is simply a file with Julia code. When you run a script, the result is similar to running each line of code in the REPL from top to bottom. For example, consider the following script:

#+begin_src julia :results none :exports code
x = 2 + 2
y = 5x - 3
x * y
#+end_src

Running this script would be similar to the following REPL commands:

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>x = 2 + 2
4

<font color="#98C379"><b>julia&gt; </b></font>y = 5x - 3
17

<font color="#98C379"><b>julia&gt; </b></font>x * y
68
</pre>
#+END_EXPORT

However, the results of each expression are not shown automatically like in the REPL.

** First Script

Often the first program people learn to write is the [[https://en.wikipedia.org/wiki/%22Hello,_World!%22_program]["Hello, World!"]] program. All it does is print =Hello, World!= to the screen. Open a file named =hello.jl= and write the following line of code:

#+begin_src julia :results output :exports code
println("Hello, World!")
#+end_src

There are a few ways to actually run this script now. First, open a terminal in the same directory as =hello.jl=. Then, type ~julia hello.jl~ and press enter. You should see the following output:

#+begin_src txt
$ julia hello.jl
Hello, World!
#+end_src

You can execute a script from inside the REPL as well. Open the REPL with the ~julia~ command and type ~include("hello.jl")~:

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>include(&quot;hello.jl&quot;)
Hello, World!
</pre>
#+END_EXPORT

The ~include~ function executes a Julia file's contents as if they were typed in the REPL.

